# Task1. Напишите программу, которая принимает на вход цифру, обозначающую день недели,
# и проверяет, является ли этот день выходным.

print('Введите число, обозначающее день недели (от 1 до 7): ')
day = int(input())
if day == 1:
    print('понедельник - рабочий день')
elif day == 2:
    print('вторник - рабочий день')
elif day == 3:
    print('среда - рабочий день')
elif day == 4:
    print('четверг - рабочий день')
elif day == 5:
    print('пятница - рабочий день')
elif day == 6:
    print('суббота - выходной день')
elif day == 7:
    print('воскресенье - выходной день')
else:
    print('Вы ввели неверное число')

